
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |    Destroy |
|:---------:|--------:|----------:|-----------:|
|     ✅     |      80 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                                         |
|:--------:|:------------------------------------------------------------------------------------------------------------------|
|    🟢     | `module.vpn.aws_autoscaling_group.openvpn`                                                                        |
|    🟢     | `module.vpn.aws_efs_file_system.openvpn-config`                                                                   |
|    🟢     | `module.vpn.aws_efs_mount_target.openvpn-config["subnet-06caf71c8b0afd909"]`                                      |
|    🟢     | `module.vpn.aws_efs_mount_target.openvpn-config["subnet-0f91dd2675e7a16c3"]`                                      |
|    🟢     | `module.vpn.aws_iam_policy.openvpn_portal_role`                                                                   |
|    🟢     | `module.vpn.aws_iam_role.openvpn_portal_role`                                                                     |
|    🟢     | `module.vpn.aws_iam_role_policy_attachment.task_role`                                                             |
|    🟢     | `module.vpn.aws_key_pair.deployer`                                                                                |
|    🟢     | `module.vpn.aws_launch_template.openvpn`                                                                          |
|    🟢     | `module.vpn.aws_lb.openvpn`                                                                                       |
|    🟢     | `module.vpn.aws_lb_listener.openvpn`                                                                              |
|    🟢     | `module.vpn.aws_lb_target_group.openvpn`                                                                          |
|    🟢     | `module.vpn.aws_route53_record.vpn_cname`                                                                         |
|    🟢     | `module.vpn.aws_security_group.efs`                                                                               |
|    🟢     | `module.vpn.aws_security_group.openvpn`                                                                           |
|    🟢     | `module.vpn.aws_vpc_security_group_egress_rule.default`                                                           |
|    🟢     | `module.vpn.aws_vpc_security_group_egress_rule.efs`                                                               |
|    🟢     | `module.vpn.aws_vpc_security_group_ingress_rule.efs`                                                              |
|    🟢     | `module.vpn.aws_vpc_security_group_ingress_rule.efs_icmp`                                                         |
|    🟢     | `module.vpn.aws_vpc_security_group_ingress_rule.icmp`                                                             |
|    🟢     | `module.vpn.aws_vpc_security_group_ingress_rule.openvpn`                                                          |
|    🟢     | `module.vpn.aws_vpc_security_group_ingress_rule.ssh`                                                              |
|    🟢     | `module.vpn.random_password.ca_passkey`                                                                           |
|    🟢     | `module.vpn.random_password.flask_secret_key`                                                                     |
|    🟢     | `module.vpn.random_string.asg_name`                                                                               |
|    🟢     | `module.vpn.random_string.profile-suffix`                                                                         |
|    🟢     | `module.vpn.random_string.role-suffix`                                                                            |
|    🟢     | `module.vpn.tls_private_key.rsa`                                                                                  |
|    🟢     | `module.vpn.module.ca_passkey.aws_secretsmanager_secret.secret`                                                   |
|    🟢     | `module.vpn.module.ca_passkey.aws_secretsmanager_secret_version.current`                                          |
|    🟢     | `module.vpn.module.flask_secret_key.aws_secretsmanager_secret.secret`                                             |
|    🟢     | `module.vpn.module.flask_secret_key.aws_secretsmanager_secret_version.current`                                    |
|    🟢     | `module.vpn.module.google_client.aws_secretsmanager_secret.secret`                                                |
|    🟢     | `module.vpn.module.google_client.aws_secretsmanager_secret_version.current`                                       |
|    🟢     | `module.vpn.module.instance_profile.aws_iam_instance_profile.profile`                                             |
|    🟢     | `module.vpn.module.instance_profile.aws_iam_policy.profile`                                                       |
|    🟢     | `module.vpn.module.instance_profile.aws_iam_role.profile`                                                         |
|    🟢     | `module.vpn.module.instance_profile.aws_iam_role_policy_attachment.profile`                                       |
|    🟢     | `module.vpn.module.openvpn-portal.aws_appautoscaling_policy.ecs_policy`                                           |
|    🟢     | `module.vpn.module.openvpn-portal.aws_appautoscaling_target.ecs_target`                                           |
|    🟢     | `module.vpn.module.openvpn-portal.aws_ecs_capacity_provider.ecs`                                                  |
|    🟢     | `module.vpn.module.openvpn-portal.aws_ecs_cluster.ecs`                                                            |
|    🟢     | `module.vpn.module.openvpn-portal.aws_ecs_cluster_capacity_providers.ecs`                                         |
|    🟢     | `module.vpn.module.openvpn-portal.aws_ecs_service.ecs`                                                            |
|    🟢     | `module.vpn.module.openvpn-portal.aws_ecs_task_definition.ecs`                                                    |
|    🟢     | `module.vpn.module.openvpn-portal.aws_iam_role.ecs_task_execution_role`                                           |
|    🟢     | `module.vpn.module.openvpn-portal.aws_iam_role_policy_attachment.ecs_task_execution_role_policy`                  |
|    🟢     | `module.vpn.module.openvpn-portal.aws_security_group.backend_extra`                                               |
|    🟢     | `module.vpn.module.openvpn-portal.aws_vpc_security_group_ingress_rule.backend_extra_reserved`                     |
|    🟢     | `module.vpn.module.openvpn-portal.aws_vpc_security_group_ingress_rule.backend_extra_user`                         |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.aws_acm_certificate.website`                                         |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.aws_acm_certificate_validation.website`                              |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.aws_alb.website`                                                     |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.aws_alb_listener.redirect_to_ssl`                                    |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.aws_alb_target_group.website`                                        |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.aws_autoscaling_group.website`                                       |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.aws_autoscaling_policy.cpu_load`                                     |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.aws_launch_template.website`                                         |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.aws_lb_listener.ssl`                                                 |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.aws_route53_record.cert_validation["openvpn-portal.infrahouse.com"]` |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.aws_route53_record.extra[0]`                                         |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.aws_s3_bucket.access_log[0]`                                         |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.aws_s3_bucket_policy.access_logs[0]`                                 |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.aws_s3_bucket_public_access_block.public_access[0]`                  |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.aws_security_group.alb`                                              |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.aws_security_group.backend`                                          |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_egress_rule.alb_outgoing`                     |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_egress_rule.backend_outgoing`                 |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_ingress_rule.alb_icmp`                        |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_ingress_rule.alb_listener_port`               |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_ingress_rule.backend_icmp`                    |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_input`               |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_local`               |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_ingress_rule.backend_user_traffic`            |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_ingress_rule.https`                           |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.random_string.profile_suffix`                                        |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.module.instance_profile.aws_iam_instance_profile.profile`            |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.module.instance_profile.aws_iam_policy.profile`                      |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.module.instance_profile.aws_iam_role.profile`                        |
|    🟢     | `module.vpn.module.openvpn-portal.module.pod.module.instance_profile.aws_iam_role_policy_attachment.profile`      |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.vpn.data.aws_iam_policy_document.instance_permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "instance_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sts:GetCallerIdentity",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:DescribeInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:ModifyInstanceAttribute",
            ]
          + resources = [
              + "*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "ec2:ResourceTag/aws:autoscaling:groupName"
            }
        }
    }

  # module.vpn.data.aws_iam_policy_document.openvpn_portal_role_permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "openvpn_portal_role_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sts:GetCallerIdentity",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.vpn.aws_autoscaling_group.openvpn will be created
  + resource "aws_autoscaling_group" "openvpn" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = (known after apply)
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_instance_lifetime            = 7776000
      + max_size                         = 3
      + metrics_granularity              = "1Minute"
      + min_size                         = 2
      + name                             = (known after apply)
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = [
          + "subnet-06caf71c8b0afd909",
          + "subnet-0f91dd2675e7a16c3",
        ]
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + instance_refresh {
          + strategy = "Rolling"

          + preferences {
              + max_healthy_percentage       = 100
              + min_healthy_percentage       = 100
              + scale_in_protected_instances = "Ignore"
              + skip_matching                = false
              + standby_instances            = "Ignore"
            }
        }

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + mixed_instances_policy (known after apply)

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "openvpn"
        }
      + tag {
          + key                 = "created_by_module"
          + propagate_at_launch = true
          + value               = "infrahouse/openvpn/aws"
        }
      + tag {
          + key                 = "service"
          + propagate_at_launch = true
          + value               = "openvpn"
        }

      + traffic_source (known after apply)
    }

  # module.vpn.aws_efs_file_system.openvpn-config will be created
  + resource "aws_efs_file_system" "openvpn-config" {
      + arn                     = (known after apply)
      + availability_zone_id    = (known after apply)
      + availability_zone_name  = (known after apply)
      + creation_token          = "openvpn-config"
      + dns_name                = (known after apply)
      + encrypted               = (known after apply)
      + id                      = (known after apply)
      + kms_key_id              = (known after apply)
      + name                    = (known after apply)
      + number_of_mount_targets = (known after apply)
      + owner_id                = (known after apply)
      + performance_mode        = (known after apply)
      + size_in_bytes           = (known after apply)
      + tags                    = {
          + "Name"              = "openvpn-config"
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "service"           = "openvpn"
        }
      + tags_all                = {
          + "Name"              = "openvpn-config"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "production"
          + "service"           = "openvpn"
        }
      + throughput_mode         = "bursting"

      + protection (known after apply)
    }

  # module.vpn.aws_efs_mount_target.openvpn-config["subnet-06caf71c8b0afd909"] will be created
  + resource "aws_efs_mount_target" "openvpn-config" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = "subnet-06caf71c8b0afd909"
    }

  # module.vpn.aws_efs_mount_target.openvpn-config["subnet-0f91dd2675e7a16c3"] will be created
  + resource "aws_efs_mount_target" "openvpn-config" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = "subnet-0f91dd2675e7a16c3"
    }

  # module.vpn.aws_iam_policy.openvpn_portal_role will be created
  + resource "aws_iam_policy" "openvpn_portal_role" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "openvpn-portal-"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
    }

  # module.vpn.aws_iam_role.openvpn_portal_role will be created
  + resource "aws_iam_role" "openvpn_portal_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnLike      = {
                              + "aws:SourceArn" = "arn:aws:ecs:us-west-1:493370826424:*"
                            }
                          + StringEquals = {
                              + "aws:SourceAccount" = "493370826424"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "openvpn-portal-"
      + path                  = "/"
      + tags_all              = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.vpn.aws_iam_role_policy_attachment.task_role will be created
  + resource "aws_iam_role_policy_attachment" "task_role" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.vpn.aws_key_pair.deployer will be created
  + resource "aws_key_pair" "deployer" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = (known after apply)
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + tags            = {
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "service"           = "openvpn"
        }
      + tags_all        = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "production"
          + "service"           = "openvpn"
        }
    }

  # module.vpn.aws_launch_template.openvpn will be created
  + resource "aws_launch_template" "openvpn" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-0ecaad63ed3668fca"
      + instance_type          = "m6in.large"
      + key_name               = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "openvpn-"
      + tags                   = {
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "service"           = "openvpn"
        }
      + tags_all               = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "production"
          + "service"           = "openvpn"
        }
      + user_data              = (known after apply)
      + vpc_security_group_ids = (known after apply)

      + iam_instance_profile {
          + arn = (known after apply)
        }

      + metadata_options (known after apply)
    }

  # module.vpn.aws_lb.openvpn will be created
  + resource "aws_lb" "openvpn" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + dns_name                                                     = (known after apply)
      + dns_record_client_routing_policy                             = "any_availability_zone"
      + enable_cross_zone_load_balancing                             = true
      + enable_deletion_protection                                   = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + internal                                                     = (known after apply)
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "network"
      + name                                                         = (known after apply)
      + name_prefix                                                  = "openvp"
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-04b8845d896c6ebde",
          + "subnet-0df885dcc99418799",
        ]
      + tags                                                         = {
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "service"           = "openvpn"
        }
      + tags_all                                                     = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "production"
          + "service"           = "openvpn"
        }
      + vpc_id                                                       = (known after apply)
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.vpn.aws_lb_listener.openvpn will be created
  + resource "aws_lb_listener" "openvpn" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 1194
      + protocol          = "TCP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.vpn.aws_lb_target_group.openvpn will be created
  + resource "aws_lb_target_group" "openvpn" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = "openvp"
      + port                               = 1194
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "TCP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "service"           = "openvpn"
        }
      + tags_all                           = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "production"
          + "service"           = "openvpn"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-08e19d859c26d18b2"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = "1194"
          + protocol            = "TCP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + enabled = true
          + type    = "source_ip"
        }

      + target_failover (known after apply)

      + target_health_state (known after apply)
    }

  # module.vpn.aws_route53_record.vpn_cname will be created
  + resource "aws_route53_record" "vpn_cname" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "openvpn.infrahouse.com"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z07662251LH3YRF2ERM3G"
    }

  # module.vpn.aws_security_group.efs will be created
  + resource "aws_security_group" "efs" {
      + arn                    = (known after apply)
      + description            = "Security group for EFS volume"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "openvpn-efs-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"              = "OpenVPN config"
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "service"           = "openvpn"
        }
      + tags_all               = {
          + "Name"              = "OpenVPN config"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "production"
          + "service"           = "openvpn"
        }
      + vpc_id                 = "vpc-08e19d859c26d18b2"
    }

  # module.vpn.aws_security_group.openvpn will be created
  + resource "aws_security_group" "openvpn" {
      + arn                    = (known after apply)
      + description            = "Manage traffic to openvpn"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "openvpn"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"              = "openvpn"
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "service"           = "openvpn"
        }
      + tags_all               = {
          + "Name"              = "openvpn"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "production"
          + "service"           = "openvpn"
        }
      + vpc_id                 = "vpc-08e19d859c26d18b2"
    }

  # module.vpn.aws_vpc_security_group_egress_rule.default will be created
  + resource "aws_vpc_security_group_egress_rule" "default" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "outgoing traffic"
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "service"           = "openvpn"
        }
      + tags_all               = {
          + "Name"              = "outgoing traffic"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "production"
          + "service"           = "openvpn"
        }
    }

  # module.vpn.aws_vpc_security_group_egress_rule.efs will be created
  + resource "aws_vpc_security_group_egress_rule" "efs" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "EFS outgoing traffic"
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "service"           = "openvpn"
        }
      + tags_all               = {
          + "Name"              = "EFS outgoing traffic"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "production"
          + "service"           = "openvpn"
        }
    }

  # module.vpn.aws_vpc_security_group_ingress_rule.efs will be created
  + resource "aws_vpc_security_group_ingress_rule" "efs" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/22"
      + description            = "Allow NFS traffic to EFS volume"
      + from_port              = 2049
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "NFS traffic"
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "service"           = "openvpn"
        }
      + tags_all               = {
          + "Name"              = "NFS traffic"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "production"
          + "service"           = "openvpn"
        }
      + to_port                = 2049
    }

  # module.vpn.aws_vpc_security_group_ingress_rule.efs_icmp will be created
  + resource "aws_vpc_security_group_ingress_rule" "efs_icmp" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all ICMP traffic"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "icmp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "ICMP traffic"
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "service"           = "openvpn"
        }
      + tags_all               = {
          + "Name"              = "ICMP traffic"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "production"
          + "service"           = "openvpn"
        }
      + to_port                = -1
    }

  # module.vpn.aws_vpc_security_group_ingress_rule.icmp will be created
  + resource "aws_vpc_security_group_ingress_rule" "icmp" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all ICMP traffic"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "icmp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "ICMP traffic"
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "service"           = "openvpn"
        }
      + tags_all               = {
          + "Name"              = "ICMP traffic"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "production"
          + "service"           = "openvpn"
        }
      + to_port                = -1
    }

  # module.vpn.aws_vpc_security_group_ingress_rule.openvpn will be created
  + resource "aws_vpc_security_group_ingress_rule" "openvpn" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow NLB health checks"
      + from_port              = 1194
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "OpenVPN access"
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "service"           = "openvpn"
        }
      + tags_all               = {
          + "Name"              = "OpenVPN access"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "production"
          + "service"           = "openvpn"
        }
      + to_port                = 1194
    }

  # module.vpn.aws_vpc_security_group_ingress_rule.ssh will be created
  + resource "aws_vpc_security_group_ingress_rule" "ssh" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow SSH traffic"
      + from_port              = 22
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "SSH access"
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "service"           = "openvpn"
        }
      + tags_all               = {
          + "Name"              = "SSH access"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "production"
          + "service"           = "openvpn"
        }
      + to_port                = 22
    }

  # module.vpn.random_password.ca_passkey will be created
  + resource "random_password" "ca_passkey" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 31
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.vpn.random_password.flask_secret_key will be created
  + resource "random_password" "flask_secret_key" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 31
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.vpn.random_string.asg_name will be created
  + resource "random_string" "asg_name" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.vpn.random_string.profile-suffix will be created
  + resource "random_string" "profile-suffix" {
      + id          = (known after apply)
      + length      = 12
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.vpn.random_string.role-suffix will be created
  + resource "random_string" "role-suffix" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.vpn.tls_private_key.rsa will be created
  + resource "tls_private_key" "rsa" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

  # module.vpn.module.ca_passkey.data.aws_iam_policy_document.permission-policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "permission-policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "*",
            ]
          + resources = [
              + "*",
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "secretsmanager:DescribeSecret",
              + "secretsmanager:GetRandomPassword",
              + "secretsmanager:GetResourcePolicy",
              + "secretsmanager:GetSecretValue",
              + "secretsmanager:ListSecretVersionIds",
            ]
          + resources = [
              + "*",
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "secretsmanager:BatchGetSecretValue",
              + "secretsmanager:CancelRotateSecret",
              + "secretsmanager:CreateSecret",
              + "secretsmanager:DeleteResourcePolicy",
              + "secretsmanager:DeleteSecret",
              + "secretsmanager:ListSecrets",
              + "secretsmanager:PutResourcePolicy",
              + "secretsmanager:PutSecretValue",
              + "secretsmanager:RemoveRegionsFromReplication",
              + "secretsmanager:ReplicateSecretToRegions",
              + "secretsmanager:RestoreSecret",
              + "secretsmanager:RotateSecret",
              + "secretsmanager:StopReplicationToReplica",
              + "secretsmanager:TagResource",
              + "secretsmanager:UntagResource",
              + "secretsmanager:UpdateSecret",
              + "secretsmanager:UpdateSecretVersionStage",
              + "secretsmanager:ValidateResourcePolicy",
            ]
          + effect    = "Deny"
          + resources = [
              + "*",
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "*",
            ]
          + effect    = "Deny"
          + resources = [
              + "*",
            ]

          + condition {
              + test     = "StringNotLike"
              + values   = [
                  + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
                  + (known after apply),
                ]
              + variable = "aws:PrincipalArn"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.vpn.module.ca_passkey.data.external.secret_value will be read during apply
  # (config refers to values not yet known)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/vpn.ca_passkey/assets/get_secret.py",
          + "us-west-1",
          + (known after apply),
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.vpn.module.ca_passkey.aws_secretsmanager_secret.secret will be created
  + resource "aws_secretsmanager_secret" "secret" {
      + arn                            = (known after apply)
      + description                    = "OpenVPN CA Key Passphrase"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = (known after apply)
      + name_prefix                    = "openvpn_ca_passphrase"
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags                           = {
          + "owner" = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
        }
      + tags_all                       = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
          + "owner"       = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
        }

      + replica (known after apply)
    }

  # module.vpn.module.ca_passkey.aws_secretsmanager_secret_version.current will be created
  + resource "aws_secretsmanager_secret_version" "current" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (sensitive value)
    }

  # module.vpn.module.flask_secret_key.data.aws_iam_policy_document.permission-policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "permission-policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "*",
            ]
          + resources = [
              + "*",
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "secretsmanager:DescribeSecret",
              + "secretsmanager:GetRandomPassword",
              + "secretsmanager:GetResourcePolicy",
              + "secretsmanager:GetSecretValue",
              + "secretsmanager:ListSecretVersionIds",
            ]
          + resources = [
              + "*",
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "secretsmanager:BatchGetSecretValue",
              + "secretsmanager:CancelRotateSecret",
              + "secretsmanager:CreateSecret",
              + "secretsmanager:DeleteResourcePolicy",
              + "secretsmanager:DeleteSecret",
              + "secretsmanager:ListSecrets",
              + "secretsmanager:PutResourcePolicy",
              + "secretsmanager:PutSecretValue",
              + "secretsmanager:RemoveRegionsFromReplication",
              + "secretsmanager:ReplicateSecretToRegions",
              + "secretsmanager:RestoreSecret",
              + "secretsmanager:RotateSecret",
              + "secretsmanager:StopReplicationToReplica",
              + "secretsmanager:TagResource",
              + "secretsmanager:UntagResource",
              + "secretsmanager:UpdateSecret",
              + "secretsmanager:UpdateSecretVersionStage",
              + "secretsmanager:ValidateResourcePolicy",
            ]
          + effect    = "Deny"
          + resources = [
              + "*",
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "*",
            ]
          + effect    = "Deny"
          + resources = [
              + "*",
            ]

          + condition {
              + test     = "StringNotLike"
              + values   = [
                  + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
                  + (known after apply),
                ]
              + variable = "aws:PrincipalArn"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.vpn.module.flask_secret_key.data.external.secret_value will be read during apply
  # (config refers to values not yet known)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/vpn.flask_secret_key/assets/get_secret.py",
          + "us-west-1",
          + (known after apply),
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.vpn.module.flask_secret_key.aws_secretsmanager_secret.secret will be created
  + resource "aws_secretsmanager_secret" "secret" {
      + arn                            = (known after apply)
      + description                    = "Flask secret key"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = (known after apply)
      + name_prefix                    = "flask_secret_key"
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags                           = {
          + "owner" = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
        }
      + tags_all                       = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
          + "owner"       = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
        }

      + replica (known after apply)
    }

  # module.vpn.module.flask_secret_key.aws_secretsmanager_secret_version.current will be created
  + resource "aws_secretsmanager_secret_version" "current" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (sensitive value)
    }

  # module.vpn.module.google_client.data.aws_iam_policy_document.permission-policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "permission-policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "*",
            ]
          + resources = [
              + "*",
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "secretsmanager:BatchGetSecretValue",
              + "secretsmanager:CancelRotateSecret",
              + "secretsmanager:DescribeSecret",
              + "secretsmanager:GetRandomPassword",
              + "secretsmanager:GetResourcePolicy",
              + "secretsmanager:GetSecretValue",
              + "secretsmanager:ListSecretVersionIds",
              + "secretsmanager:ListSecrets",
              + "secretsmanager:PutSecretValue",
              + "secretsmanager:RestoreSecret",
              + "secretsmanager:RotateSecret",
              + "secretsmanager:UpdateSecret",
              + "secretsmanager:UpdateSecretVersionStage",
            ]
          + resources = [
              + "*",
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "secretsmanager:CreateSecret",
              + "secretsmanager:DeleteResourcePolicy",
              + "secretsmanager:DeleteSecret",
              + "secretsmanager:PutResourcePolicy",
              + "secretsmanager:RemoveRegionsFromReplication",
              + "secretsmanager:ReplicateSecretToRegions",
              + "secretsmanager:StopReplicationToReplica",
              + "secretsmanager:TagResource",
              + "secretsmanager:UntagResource",
              + "secretsmanager:ValidateResourcePolicy",
            ]
          + effect    = "Deny"
          + resources = [
              + "*",
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "secretsmanager:DescribeSecret",
              + "secretsmanager:GetRandomPassword",
              + "secretsmanager:GetResourcePolicy",
              + "secretsmanager:GetSecretValue",
              + "secretsmanager:ListSecretVersionIds",
            ]
          + resources = [
              + "*",
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "secretsmanager:BatchGetSecretValue",
              + "secretsmanager:CancelRotateSecret",
              + "secretsmanager:CreateSecret",
              + "secretsmanager:DeleteResourcePolicy",
              + "secretsmanager:DeleteSecret",
              + "secretsmanager:ListSecrets",
              + "secretsmanager:PutResourcePolicy",
              + "secretsmanager:PutSecretValue",
              + "secretsmanager:RemoveRegionsFromReplication",
              + "secretsmanager:ReplicateSecretToRegions",
              + "secretsmanager:RestoreSecret",
              + "secretsmanager:RotateSecret",
              + "secretsmanager:StopReplicationToReplica",
              + "secretsmanager:TagResource",
              + "secretsmanager:UntagResource",
              + "secretsmanager:UpdateSecret",
              + "secretsmanager:UpdateSecretVersionStage",
              + "secretsmanager:ValidateResourcePolicy",
            ]
          + effect    = "Deny"
          + resources = [
              + "*",
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "*",
            ]
          + effect    = "Deny"
          + resources = [
              + "*",
            ]

          + condition {
              + test     = "StringNotLike"
              + values   = [
                  + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
                  + "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50",
                  + (known after apply),
                ]
              + variable = "aws:PrincipalArn"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.vpn.module.google_client.data.external.secret_value will be read during apply
  # (config refers to values not yet known)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/vpn.google_client/assets/get_secret.py",
          + "us-west-1",
          + (known after apply),
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.vpn.module.google_client.aws_secretsmanager_secret.secret will be created
  + resource "aws_secretsmanager_secret" "secret" {
      + arn                            = (known after apply)
      + description                    = "A JSON with Google OAuth Client ID"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = (known after apply)
      + name_prefix                    = "google_client"
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags                           = {
          + "owner" = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
        }
      + tags_all                       = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
          + "owner"       = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
        }

      + replica (known after apply)
    }

  # module.vpn.module.google_client.aws_secretsmanager_secret_version.current will be created
  + resource "aws_secretsmanager_secret_version" "current" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = [
          + "INITIAL",
        ]
    }

  # module.vpn.module.instance_profile.aws_iam_instance_profile.profile will be created
  + resource "aws_iam_instance_profile" "profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all    = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/instance-profile/aws"
          + "environment"       = "production"
        }
      + unique_id   = (known after apply)
    }

  # module.vpn.module.instance_profile.aws_iam_policy.profile will be created
  + resource "aws_iam_policy" "profile" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all         = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/instance-profile/aws"
          + "environment"       = "production"
        }
    }

  # module.vpn.module.instance_profile.aws_iam_role.profile will be created
  + resource "aws_iam_role" "profile" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all              = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/instance-profile/aws"
          + "environment"       = "production"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.vpn.module.instance_profile.aws_iam_role_policy_attachment.profile will be created
  + resource "aws_iam_role_policy_attachment" "profile" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.vpn.module.openvpn-portal.data.aws_key_pair.ssh_key_pair will be read during apply
  # (config refers to values not yet known)
 <= data "aws_key_pair" "ssh_key_pair" {
      + arn         = (known after apply)
      + create_time = (known after apply)
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + key_name    = (known after apply)
      + key_type    = (known after apply)
      + public_key  = (known after apply)
      + tags        = (known after apply)
    }

  # module.vpn.module.openvpn-portal.aws_appautoscaling_policy.ecs_policy will be created
  + resource "aws_appautoscaling_policy" "ecs_policy" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "cpu-auto-scaling"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/openvpn-portal/openvpn-portal"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 300
          + target_value       = 80

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.vpn.module.openvpn-portal.aws_appautoscaling_target.ecs_target will be created
  + resource "aws_appautoscaling_target" "ecs_target" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 1
      + min_capacity       = 1
      + resource_id        = "service/openvpn-portal/openvpn-portal"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
    }

  # module.vpn.module.openvpn-portal.aws_ecs_capacity_provider.ecs will be created
  + resource "aws_ecs_capacity_provider" "ecs" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "openvpn-portal"
      + tags_all = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }

      + auto_scaling_group_provider {
          + auto_scaling_group_arn         = (known after apply)
          + managed_draining               = "ENABLED"
          + managed_termination_protection = "ENABLED"

          + managed_scaling {
              + instance_warmup_period    = 300
              + maximum_scaling_step_size = 10
              + minimum_scaling_step_size = 1
              + status                    = "ENABLED"
              + target_capacity           = 100
            }
        }
    }

  # module.vpn.module.openvpn-portal.aws_ecs_cluster.ecs will be created
  + resource "aws_ecs_cluster" "ecs" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "openvpn-portal"
      + tags_all = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.vpn.module.openvpn-portal.aws_ecs_cluster_capacity_providers.ecs will be created
  + resource "aws_ecs_cluster_capacity_providers" "ecs" {
      + capacity_providers = [
          + "openvpn-portal",
        ]
      + cluster_name       = "openvpn-portal"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "openvpn-portal"
          + weight            = 100
        }
    }

  # module.vpn.module.openvpn-portal.aws_ecs_service.ecs will be created
  + resource "aws_ecs_service" "ecs" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 300
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "openvpn-portal"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = (known after apply)
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "openvpn-portal"
          + weight            = 100
        }

      + load_balancer {
          + container_name   = "openvpn-portal"
          + container_port   = 8080
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + timeouts {
          + delete = "10m"
        }
    }

  # module.vpn.module.openvpn-portal.aws_ecs_task_definition.ecs will be created
  + resource "aws_ecs_task_definition" "ecs" {
      + arn                   = (known after apply)
      + arn_without_revision  = (known after apply)
      + container_definitions = (known after apply)
      + execution_role_arn    = (known after apply)
      + family                = "openvpn-portal"
      + id                    = (known after apply)
      + network_mode          = (known after apply)
      + revision              = (known after apply)
      + skip_destroy          = false
      + tags_all              = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + task_role_arn         = (known after apply)
      + track_latest          = false

      + volume {
          + configure_at_launch = (known after apply)
          + name                = "data"
            # (1 unchanged attribute hidden)

          + efs_volume_configuration {
              + file_system_id          = (known after apply)
              + root_directory          = "/"
              + transit_encryption_port = 0
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.vpn.module.openvpn-portal.aws_iam_role.ecs_task_execution_role will be created
  + resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "openvpn-portalTaskExecutionRole"
      + path                  = "/"
      + tags_all              = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.vpn.module.openvpn-portal.aws_iam_role_policy_attachment.ecs_task_execution_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = (known after apply)
    }

  # module.vpn.module.openvpn-portal.aws_security_group.backend_extra will be created
  + resource "aws_security_group" "backend_extra" {
      + arn                    = (known after apply)
      + description            = "Backend extrac security group for service openvpn-portal"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "openvpn-portal-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "ECS openvpn-portal backend"
        }
      + tags_all               = {
          + "Name"        = "ECS openvpn-portal backend"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + vpc_id                 = "vpc-08e19d859c26d18b2"
    }

  # module.vpn.module.openvpn-portal.aws_vpc_security_group_ingress_rule.backend_extra_reserved will be created
  + resource "aws_vpc_security_group_ingress_rule" "backend_extra_reserved" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "ECS reserved ports for service openvpn-portal"
      + from_port              = 2375
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "ECS reserved"
        }
      + tags_all               = {
          + "Name"        = "ECS reserved"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + to_port                = 2376
    }

  # module.vpn.module.openvpn-portal.aws_vpc_security_group_ingress_rule.backend_extra_user will be created
  + resource "aws_vpc_security_group_ingress_rule" "backend_extra_user" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "ECS user traffic ports for service openvpn-portal"
      + from_port              = 32768
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "ECS user traffic"
        }
      + tags_all               = {
          + "Name"        = "ECS user traffic"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + to_port                = 65535
    }

  # module.vpn.module.userdata.data.cloudinit_config.config will be read during apply
  # (config refers to values not yet known)
 <= data "cloudinit_config" "config" {
      + base64_encode = true
      + boundary      = (known after apply)
      + gzip          = false
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = (known after apply)
          + content_type = "text/cloud-config"
        }
    }

  # module.vpn.module.openvpn-portal.module.pod.data.aws_iam_policy_document.access_logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "access_logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::027434742980:root",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_acm_certificate.website will be created
  + resource "aws_acm_certificate" "website" {
      + arn                       = (known after apply)
      + domain_name               = "openvpn-portal.infrahouse.com"
      + domain_validation_options = [
          + {
              + domain_name           = "openvpn-portal.infrahouse.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "openvpn-portal.infrahouse.com",
        ]
      + tags_all                  = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_acm_certificate_validation.website will be created
  + resource "aws_acm_certificate_validation" "website" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_alb.website will be created
  + resource "aws_alb" "website" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 600
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = (known after apply)
      + name_prefix                                                  = "openvp"
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-04b8845d896c6ebde",
          + "subnet-0df885dcc99418799",
        ]
      + tags                                                         = (known after apply)
      + tags_all                                                     = (known after apply)
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + bucket  = (known after apply)
          + enabled = true
        }

      + subnet_mapping (known after apply)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_alb_listener.redirect_to_ssl will be created
  + resource "aws_alb_listener" "redirect_to_ssl" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = (known after apply)
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + mutual_authentication (known after apply)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_alb_target_group.website will be created
  + resource "aws_alb_target_group" "website" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-08e19d859c26d18b2"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 5
          + matcher             = "200"
          + path                = "/status"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 4
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = 86400
          + enabled         = false
          + type            = "lb_cookie"
        }

      + target_failover (known after apply)

      + target_health_state (known after apply)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_autoscaling_group.website will be created
  + resource "aws_autoscaling_group" "website" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = (known after apply)
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "EC2"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_instance_lifetime            = 2592000
      + max_size                         = 1
      + metrics_granularity              = "1Minute"
      + min_elb_capacity                 = 1
      + min_size                         = 1
      + name                             = (known after apply)
      + name_prefix                      = "openvp"
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = true
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = [
          + "subnet-06caf71c8b0afd909",
          + "subnet-0f91dd2675e7a16c3",
        ]
      + wait_for_capacity_timeout        = "20m"
      + warm_pool_size                   = (known after apply)

      + instance_maintenance_policy {
          + max_healthy_percentage = 200
          + min_healthy_percentage = 100
        }

      + instance_refresh {
          + strategy = "Rolling"
          + triggers = [
              + "tag",
            ]

          + preferences {
              + max_healthy_percentage       = 100
              + min_healthy_percentage       = 100
              + scale_in_protected_instances = "Refresh"
              + skip_matching                = false
              + standby_instances            = "Ignore"
            }
        }

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + mixed_instances_policy (known after apply)

      + tag {
          + key                 = "AmazonECSManaged"
          + propagate_at_launch = true
          + value               = "true"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "openvpn-portal"
        }
      + tag {
          + key                 = "account"
          + propagate_at_launch = true
          + value               = "493370826424"
        }
      + tag {
          + key                 = "created_by_module"
          + propagate_at_launch = true
          + value               = "infrahouse/website-pod/aws"
        }
      + tag {
          + key                 = "environment"
          + propagate_at_launch = true
          + value               = "development"
        }
      + tag {
          + key                 = "managed-by"
          + propagate_at_launch = true
          + value               = "terraform"
        }
      + tag {
          + key                 = "service"
          + propagate_at_launch = true
          + value               = "openvpn-portal"
        }

      + traffic_source (known after apply)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_autoscaling_policy.cpu_load will be created
  + resource "aws_autoscaling_policy" "cpu_load" {
      + arn                     = (known after apply)
      + autoscaling_group_name  = (known after apply)
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = (known after apply)
      + policy_type             = "TargetTrackingScaling"

      + target_tracking_configuration {
          + disable_scale_in = false
          + target_value     = 80

          + predefined_metric_specification {
              + predefined_metric_type = "ASGAverageCPUUtilization"
            }
        }
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_launch_template.website will be created
  + resource "aws_launch_template" "website" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-05847801b5213b5e1"
      + instance_type          = "t3.small"
      + key_name               = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "openvp"
      + tags_all               = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + user_data              = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJ3cml0ZV9maWxlcyI6Ci0gImNvbnRlbnQiOiB8LQogICAgRUNTX0NMVVNURVI9b3BlbnZwbi1wb3J0YWwKICAgIEVDU19MT0dMRVZFTD1kZWJ1ZwogICAgRUNTX0FMTE9XX09GRkhPU1RfSU5UUk9TUEVDVElPTl9BQ0NFU1M9dHJ1ZQogICJwYXRoIjogIi9ldGMvZWNzL2Vjcy5jb25maWciCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCg0KLS1NSU1FQk9VTkRBUlktLQ0K"
      + vpc_security_group_ids = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + delete_on_termination = "true"
              + iops                  = (known after apply)
              + throughput            = (known after apply)
              + volume_size           = 30
              + volume_type           = (known after apply)
            }
        }

      + iam_instance_profile {
          + arn = (known after apply)
        }

      + metadata_options (known after apply)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_lb_listener.ssl will be created
  + resource "aws_lb_listener" "ssl" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_route53_record.cert_validation["openvpn-portal.infrahouse.com"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z07662251LH3YRF2ERM3G"
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_route53_record.extra[0] will be created
  + resource "aws_route53_record" "extra" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "openvpn-portal.infrahouse.com"
      + type            = "A"
      + zone_id         = "Z07662251LH3YRF2ERM3G"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_s3_bucket.access_log[0] will be created
  + resource "aws_s3_bucket" "access_log" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "openvp-access-log-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_s3_bucket_policy.access_logs[0] will be created
  + resource "aws_s3_bucket_policy" "access_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_s3_bucket_public_access_block.public_access[0] will be created
  + resource "aws_s3_bucket_public_access_block" "public_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Load balancer security group for service openvpn-portal"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "web-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "openvpn-portal load balancer"
        }
      + tags_all               = {
          + "Name"        = "openvpn-portal load balancer"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + vpc_id                 = "vpc-08e19d859c26d18b2"
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_security_group.backend will be created
  + resource "aws_security_group" "backend" {
      + arn                    = (known after apply)
      + description            = "Backend security group for service openvpn-portal"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "web-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "openvpn-portal backend"
        }
      + tags_all               = {
          + "Name"        = "openvpn-portal backend"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + vpc_id                 = "vpc-08e19d859c26d18b2"
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_egress_rule.alb_outgoing will be created
  + resource "aws_vpc_security_group_egress_rule" "alb_outgoing" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "outgoing traffic"
        }
      + tags_all               = {
          + "Name"        = "outgoing traffic"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_egress_rule.backend_outgoing will be created
  + resource "aws_vpc_security_group_egress_rule" "backend_outgoing" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "outgoing traffic"
        }
      + tags_all               = {
          + "Name"        = "outgoing traffic"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_ingress_rule.alb_icmp will be created
  + resource "aws_vpc_security_group_ingress_rule" "alb_icmp" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all ICMP traffic"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "icmp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "ICMP traffic"
        }
      + tags_all               = {
          + "Name"        = "ICMP traffic"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + to_port                = -1
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_ingress_rule.alb_listener_port will be created
  + resource "aws_vpc_security_group_ingress_rule" "alb_listener_port" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "User traffic to port 80"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "user traffic"
        }
      + tags_all               = {
          + "Name"        = "user traffic"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + to_port                = 80
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_ingress_rule.backend_icmp will be created
  + resource "aws_vpc_security_group_ingress_rule" "backend_icmp" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all ICMP traffic"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "icmp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "ICMP traffic"
        }
      + tags_all               = {
          + "Name"        = "ICMP traffic"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + to_port                = -1
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_input will be created
  + resource "aws_vpc_security_group_ingress_rule" "backend_ssh_input" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "SSH access from the service specified CIDR range"
      + from_port              = 22
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "SSH additional"
        }
      + tags_all               = {
          + "Name"        = "SSH additional"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + to_port                = 22
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_local will be created
  + resource "aws_vpc_security_group_ingress_rule" "backend_ssh_local" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/22"
      + description            = "SSH access from the service openvpn-portal VPC"
      + from_port              = 22
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "SSH local"
        }
      + tags_all               = {
          + "Name"        = "SSH local"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + to_port                = 22
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_ingress_rule.backend_user_traffic will be created
  + resource "aws_vpc_security_group_ingress_rule" "backend_user_traffic" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/22"
      + description            = "User traffic from the Load Balancer"
      + from_port              = 8080
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "user traffic"
        }
      + tags_all               = {
          + "Name"        = "user traffic"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + to_port                = 8080
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_ingress_rule.https will be created
  + resource "aws_vpc_security_group_ingress_rule" "https" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "User traffic to HTTPS port"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "https user traffic"
        }
      + tags_all               = {
          + "Name"        = "https user traffic"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + to_port                = 443
    }

  # module.vpn.module.openvpn-portal.module.pod.random_string.profile_suffix will be created
  + resource "random_string" "profile_suffix" {
      + id          = (known after apply)
      + length      = 12
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.vpn.module.openvpn-portal.module.pod.module.instance_profile.aws_iam_instance_profile.profile will be created
  + resource "aws_iam_instance_profile" "profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all    = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/instance-profile/aws"
          + "environment"       = "production"
        }
      + unique_id   = (known after apply)
    }

  # module.vpn.module.openvpn-portal.module.pod.module.instance_profile.aws_iam_policy.profile will be created
  + resource "aws_iam_policy" "profile" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ec2:Describe*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "ecs:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all         = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/instance-profile/aws"
          + "environment"       = "production"
        }
    }

  # module.vpn.module.openvpn-portal.module.pod.module.instance_profile.aws_iam_role.profile will be created
  + resource "aws_iam_role" "profile" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all              = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/instance-profile/aws"
          + "environment"       = "production"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.vpn.module.openvpn-portal.module.pod.module.instance_profile.aws_iam_role_policy_attachment.profile will be created
  + resource "aws_iam_role_policy_attachment" "profile" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

Plan: 80 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDgwLCAiY2hhbmdlIjogMCwgImRlc3Ryb3kiOiAwfX0=
```
</details>